//? ## Example 1 - Базові операції з масивом

// 1. Створити масив з елементами 'Jazz' и 'Blues'
const genres;

// 2. Додати 'Rock' в кінець масиву.

// 3. Вивести в консоль перший елемент масива (не видаляючи його)

// 4. Вивести в консоль останній элемент масива. Має працювати для будь-якої довжини.

// 5. Видалити з масиву перший елемент і вивести в консоль.

// 6. Додати «Country» і «Reggy» в початок масиву (зберегти порядок).




//? ## Example 2 - Масиви і строки
/*
Написати скрипт для обчислення площі прямокутника зі сторонами, довжину яких
отримуємо у змінній `sides` у вигляді строки.
Значення гарантовано розділені одним пробілом
*/

const sides = '7 10';





//? ## Example 3 - Перебор масивів, умови
/*
Написати скрипт для перебору масива `fruits` циклом `for`.
Для кожного элементу вивести в консоль строку формата `номер_елемента: значення_элемента`.
Нумерациія має починатись з `1`.
*/

// ускладнення - НЕ виводити в консоль дані якщо фрукти містяться в масиві fruitsToIgnore
const fruitsToIgnore = ['🍌', '🍋'];

const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];





//? ## Example 4 - Масиви і цикли
/*
Написати скрипт що виводить в консоль ім'я і телефон користувачів.
У змінних `names` і `phones` зберігаються строки імен і телефонних номерів,
розділені комами.
Порядок імен відповідає порядку номерів.
Кількість імен и телефонів гарантовано однакова.
  - Обрати зручний формат
*/

// const names = 'Jacob,William,Solomon,Nicolas';
// const phones = '89001234567,89001112233,890055566377,890055566300';





// ? Масиви і строки
//? ## Example 5
/*
Написати скрипт що виводить в консоль задану фразу без першого і останнього слів.
Фінальна строка не має починатись чи закінчуватись пробілом.
Скрипт має працювати для будь-якої строки.
*/

const phrase = 'Welcome to the bright future';





//? ## Example 6
/*
Написати скрипт який «розверне» строку (зворотній порядок літер) і виведе в консоль.
Три варіанти - цикл for (без масивів), цикл for-of + масиви, без циклів?
*/

const anotherPhrase = 'Welcome to the future';





//? ## Example 7 - Пошук елемента
/*
Написати скрипт пошуку найменшого числа в массиве. Чи є варіанти?
*/

const numbers = [2, 17, 94, 1, 23, 37];





//? ## Example 8 - Сортування масива с циклом
/*
Написати скрипт сортування масиву строк в алфавітному порядку.
*/

const langs = ['python', 'javascript', 'c++', 'haskel', 'php', 'ruby', 'ada'];
